[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:73:32
     
     const testid = "CommonsForm";
     const curr = new Date();
-    const localTime = new Date(curr.getTime() - curr.getTimezoneOffset() * 60000);
+    const localTime = new Date(curr.getTime() + curr.getTimezoneOffset() * 60000);
     const today = localTime.toISOString().split('T')[0];
     const currMonth = curr.getMonth() % 12;
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-05-16)

Expected the element to have value:
  2024-05-16
Received:
  2024-05-17

[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:73:49
     
     const testid = "CommonsForm";
     const curr = new Date();
-    const localTime = new Date(curr.getTime() - curr.getTimezoneOffset() * 60000);
+    const localTime = new Date(curr.getTime() - curr.getTimezoneOffset() / 60000);
     const today = localTime.toISOString().split('T')[0];
     const currMonth = curr.getMonth() % 12;
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-05-16)

Expected the element to have value:
  2024-05-16
Received:
  2024-05-17

[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:75:23
     const curr = new Date();
     const localTime = new Date(curr.getTime() - curr.getTimezoneOffset() * 60000);
     const today = localTime.toISOString().split('T')[0];
-    const currMonth = curr.getMonth() % 12;
+    const currMonth = curr.getMonth() * 12;
     const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString().substr(0, 10);
     const DefaultVals = {
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-06-16)

Expected the element to have value:
  2024-06-16
Received:
  2028-02-16

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:310:53
             </Row>
 
             <Row>
-                <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r3`}>
+                <Form.Group className="mb-5" style={{}} data-testid={`${testid}-r3`}>
                     <Form.Label htmlFor="startingDate">Starting Date</Form.Label>
                     <Form.Control
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 300px;
