[Killed] BlockStatement
src/main/utils/dateUtils.js:52:44
     return dateFromEpoch.toLocaleDateString();
 }
 
-export function makeCommonsStartEndDate () {
-
-    const curr = new Date();
-    const localTime = new Date(curr.getTime() - curr.getTimezoneOffset() * 60000);
-    const today = localTime.toISOString().split('T')[0];
-    const currMonth = localTime.getMonth() % 12;
-    const nextMonth = new Date(localTime.getFullYear(), currMonth + 1, localTime.getDate()).toISOString().substr(0, 10);
-
-    return [today, nextMonth];
-
-}
+export function makeCommonsStartEndDate () {}
 
 export {timestampToDate, padWithZero, daysSinceTimestamp};
killedBy: dateUtils tests makeCommonsStartEndDate tests correctly creates the start and end date for troublsome times
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:57:23
     const curr = new Date();
     const localTime = new Date(curr.getTime() - curr.getTimezoneOffset() * 60000);
     const today = localTime.toISOString().split('T')[0];
-    const currMonth = localTime.getMonth() % 12;
+    const currMonth = localTime.getMonth() * 12;
     const nextMonth = new Date(localTime.getFullYear(), currMonth + 1, localTime.getDate()).toISOString().substr(0, 10);
 
killedBy: dateUtils tests makeCommonsStartEndDate tests correctly creates the start and end date for troublsome times
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2022-07-30"
Received: "2027-03-02"

[Killed] MethodExpression
src/main/utils/dateUtils.js:58:23
     const localTime = new Date(curr.getTime() - curr.getTimezoneOffset() * 60000);
     const today = localTime.toISOString().split('T')[0];
     const currMonth = localTime.getMonth() % 12;
-    const nextMonth = new Date(localTime.getFullYear(), currMonth + 1, localTime.getDate()).toISOString().substr(0, 10);
+    const nextMonth = new Date(localTime.getFullYear(), currMonth + 1, localTime.getDate()).toISOString();
 
     return [today, nextMonth];
killedBy: dateUtils tests makeCommonsStartEndDate tests correctly creates the start and end date for troublsome times
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2022-07-30"
Received: "2022-07-30T07:00:00.000Z"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:58:57
     const localTime = new Date(curr.getTime() - curr.getTimezoneOffset() * 60000);
     const today = localTime.toISOString().split('T')[0];
     const currMonth = localTime.getMonth() % 12;
-    const nextMonth = new Date(localTime.getFullYear(), currMonth + 1, localTime.getDate()).toISOString().substr(0, 10);
+    const nextMonth = new Date(localTime.getFullYear(), currMonth - 1, localTime.getDate()).toISOString().substr(0, 10);
 
     return [today, nextMonth];
killedBy: dateUtils tests makeCommonsStartEndDate tests correctly creates the start and end date for troublsome times
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2022-07-30"
Received: "2022-05-30"
