[Killed] ConditionalExpression
src/main/pages/PlayPage.js:153:77
         fontSize: "30px",
     };
 
-    const isUserInCommon = currentUser?.root?.user?.commons?.some(common => common.id === parseInt(commonsId));
+    const isUserInCommon = currentUser?.root?.user?.commons?.some(common => true);
 
     return (
killedBy: PlayPage tests Shows 'Access Denied' message if user is not in the commons
statusReason: Error: Unable to find an element with the text: Access Denied.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] OptionalChaining
src/main/pages/PlayPage.js:153:28
         fontSize: "30px",
     };
 
-    const isUserInCommon = currentUser?.root?.user?.commons?.some(common => common.id === parseInt(commonsId));
+    const isUserInCommon = currentUser?.root.user?.commons?.some(common => common.id === parseInt(commonsId));
 
     return (
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] LogicalOperator
src/main/pages/PlayPage.js:165:18
         >
             <BasicLayout>
                 <Container>
-                {isUserInCommon && !!currentUser && <CommonsPlay currentUser={currentUser} />}
+                {isUserInCommon && !!currentUser || <CommonsPlay currentUser={currentUser} />}
                     {!isUserInCommon && currentUser && <h1 style={{ color: 'red', backgroundColor: 'black', padding: '50px', 
                     textAlign: 'center' }}>
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:165:36
         >
             <BasicLayout>
                 <Container>
-                {isUserInCommon && !!currentUser && <CommonsPlay currentUser={currentUser} />}
+                {isUserInCommon && !currentUser && <CommonsPlay currentUser={currentUser} />}
                     {!isUserInCommon && currentUser && <h1 style={{ color: 'red', backgroundColor: 'black', padding: '50px', 
                     textAlign: 'center' }}>
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:166:22
             <BasicLayout>
                 <Container>
                 {isUserInCommon && !!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {!isUserInCommon && currentUser && <h1 style={{ color: 'red', backgroundColor: 'black', padding: '50px', 
-                    textAlign: 'center' }}>
-                        Access Denied.
-                    </h1> }   
+                    {true }   
                     {!!commonsPlus && (
                         <CommonsOverview
killedBy: PlayPage tests Shows 'Access Denied' message if user is not in the commons
statusReason: Error: Unable to find an element with the text: Access Denied.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:166:22
             <BasicLayout>
                 <Container>
                 {isUserInCommon && !!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {!isUserInCommon && currentUser && <h1 style={{ color: 'red', backgroundColor: 'black', padding: '50px', 
-                    textAlign: 'center' }}>
-                        Access Denied.
-                    </h1> }   
+                    {false }   
                     {!!commonsPlus && (
                         <CommonsOverview
killedBy: PlayPage tests Shows 'Access Denied' message if user is not in the commons
statusReason: Error: Unable to find an element with the text: Access Denied.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:170:22
                     textAlign: 'center' }}>
                         Access Denied.
                     </h1> }   
-                    {!!commonsPlus && (
-                        <CommonsOverview
-                            commonsPlus={commonsPlus}
-                            currentUser={currentUser}
-                        />
-                    )}
+                    {true}
                     <br />
                     {!!userCommons && !!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:170:22
                     textAlign: 'center' }}>
                         Access Denied.
                     </h1> }   
-                    {!!commonsPlus && (
-                        <CommonsOverview
-                            commonsPlus={commonsPlus}
-                            currentUser={currentUser}
-                        />
-                    )}
+                    {false}
                     <br />
                     {!!userCommons && !!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] LogicalOperator
src/main/pages/PlayPage.js:204:15
                     )}
                 </Container>
             </BasicLayout>
-            { (hasRole(currentUser, "ROLE_ADMIN") || (!!commonsPlus && commonsPlus.commons.showChat)) &&
-                <div style={chatContainerStyle} data-testid="playpage-chat-div">
-                    {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
-                    <Button
-                        style={chatButtonStyle}
-                        onClick={toggleChatWindow}
-                        data-testid="playpage-chat-toggle"
-                    >
-                        {!!isChatOpen ? (
-                            <span style={emojiStyle} data-testid="close-icon">
-                                ❌
-                            </span>
-                        ) : (
-                            <span style={emojiStyle} data-testid="message-icon">
-                                💬
-                            </span>
-                        )}
-                    </Button>
-                </div>
+            { hasRole(currentUser, "ROLE_ADMIN") || !!commonsPlus && commonsPlus.commons.showChat || <div style={chatContainerStyle} data-testid="playpage-chat-div">
+                    {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
+                    <Button style={chatButtonStyle} onClick={toggleChatWindow} data-testid="playpage-chat-toggle">
+                        {!!isChatOpen ? <span style={emojiStyle} data-testid="close-icon">
+                                ❌
+                            </span> : <span style={emojiStyle} data-testid="message-icon">
+                                💬
+                            </span>}
+                    </Button>
+                </div>
             }
         </div>
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="playpage-chat-toggle"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] LogicalOperator
src/main/pages/PlayPage.js:204:55
                     )}
                 </Container>
             </BasicLayout>
-            { (hasRole(currentUser, "ROLE_ADMIN") || (!!commonsPlus && commonsPlus.commons.showChat)) &&
+            { (hasRole(currentUser, "ROLE_ADMIN") || (!!commonsPlus || commonsPlus.commons.showChat)) &&
                 <div style={chatContainerStyle} data-testid="playpage-chat-div">
                     {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')
