[Killed] BlockStatement
main/components/Announcement/AnnouncementTable.js:30:30
     // Stryker disable next-line all : TODO try to make a good test for this
     const deleteCallback = async (cell) => {
         deleteMutation.mutate(cell, {
-            onSuccess: () => {
-                navigate(0); // Refreshes the current page
-            }
+            onSuccess: () => {}
         });
     };
killedBy: AnnouncementTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 0

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.js:44:23
         },
         {
             Header: 'Start Date ISO Format',
-            accessor: 'startDate',
+            accessor: "",
         },
         {
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-startDate"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] ObjectLiteral
main/components/Announcement/AnnouncementTable.js:46:9
             Header: 'Start Date ISO Format',
             accessor: 'startDate',
         },
-        {
-            Header: 'End Date ISO Format',
-            accessor: 'endDate',
-        },
+        {},
         {
             Header: 'Announcement',
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Announcement/AnnouncementTable.js:50:9
             Header: 'End Date ISO Format',
             accessor: 'endDate',
         },
-        {
-            Header: 'Announcement',
-            accessor: 'announcementText',
-            Cell: ({ value }) => <div className="announcement-text">{value}</div>,
-        }
+        {}
     ];
 
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Announcement/AnnouncementTable.js:53:19
         {
             Header: 'Announcement',
             accessor: 'announcementText',
-            Cell: ({ value }) => <div className="announcement-text">{value}</div>,
+            Cell: () => undefined,
         }
     ];
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.js:58:43
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "AnnouncementTable"));
+        columns.push(ButtonColumn("Edit", "", editCallback, "AnnouncementTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "AnnouncementTable"));
     } 
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.js:59:45
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "AnnouncementTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "AnnouncementTable"));
+        columns.push(ButtonColumn("Delete", "", deleteCallback, "AnnouncementTable"));
     } 
 
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
