[Killed] BlockStatement
src/main/pages/AdminEditAnnouncementsPage.js:4:54
 import React from "react";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function AdminEditAnnouncementsPage() {
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Feature Coming Soon</h1>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function AdminEditAnnouncementsPage() {}
killedBy: AdminCreateAnnouncements tests renders correctly without crashing
statusReason: Error: AdminEditAnnouncementsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
