[Killed] BlockStatement
src/main/utils/announcementUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/announcements/delete",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
killedBy: AnnouncementTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 0

Number of calls: 0

<html>
  <head />
