[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:15:32
     const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard );
     // Stryker disable next-line all
     const announcementsButtonClick = () => { navigate("/announcements/" + commonsPlus.commons.id) };
-    const showAnnouncements = (hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showAnnouncements );
+    const showAnnouncements = (true );
     return (
         <Card data-testid="CommonsOverview">
killedBy: CommonsOverview tests No annoucementPage for an ordinary user when commons has showannoucement = false
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:15:32
     const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard );
     // Stryker disable next-line all
     const announcementsButtonClick = () => { navigate("/announcements/" + commonsPlus.commons.id) };
-    const showAnnouncements = (hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showAnnouncements );
+    const showAnnouncements = (false );
     return (
         <Card data-testid="CommonsOverview">
killedBy: CommonsOverview tests Redirects to the AnnouncementPage for an admin when you click visit
statusReason: Error: Unable to find an element by: [data-testid="user-announcements-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] LogicalOperator
main/components/Commons/CommonsOverview.js:32:22
                         </Button>)}
                     </Col>
                     <Col>
-                    {showAnnouncements &&
-                        (<Button variant="outline-success" data-testid="user-announcements-button" onClick={announcementsButtonClick}>
-                            Announcements
-                        </Button>)}
+                    {showAnnouncements || <Button variant="outline-success" data-testid="user-announcements-button" onClick={announcementsButtonClick}>
+                            Announcements
+                        </Button>}
                     </Col>
                 </Row>
killedBy: CommonsOverview tests Redirects to the AnnouncementPage for an admin when you click visit
statusReason: Error: Unable to find an element by: [data-testid="user-announcements-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:32:22
                         </Button>)}
                     </Col>
                     <Col>
-                    {showAnnouncements &&
-                        (<Button variant="outline-success" data-testid="user-announcements-button" onClick={announcementsButtonClick}>
-                            Announcements
-                        </Button>)}
+                    {true}
                     </Col>
                 </Row>
killedBy: CommonsOverview tests Redirects to the AnnouncementPage for an admin when you click visit
statusReason: Error: Unable to find an element by: [data-testid="user-announcements-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >
