[Killed] BlockStatement
main/components/Commons/CommonsOverview.js:22:21
     const [error, setError] = useState('');
 
     const commonsId = commonsPlus.commons.id;
-    useEffect(() => {
-        setLoading(true);
-        setError('');  // Clear previous error state before new request
-        const fetchData = async () => {
-            try {
-                const response = await axios.get(`/api/announcements/getbycommonsid?commonsId=${commonsId}`);
-                setAnnouncements(response.data);
-            } catch (error) {
-                // Stryker disable next-line all
-                console.error('Failed to fetch announcements:', error);
-                // Stryker disable next-line all
-                setError('Failed to load announcements');
-            } finally {
-                // Stryker disable next-line all
-                setLoading(false);
-            }
-        };
-
-        fetchData();
-    // Stryker disable next-line all  
-    }, [commonsId]);
+    useEffect(() => {}, [commonsId]);
 
 
killedBy: CommonsOverview tests No LeaderboardPage for an ordinary user when commons has showLeaderboard = false
statusReason: TestingLibraryElementError: Unable to find an element with the text: Failed to load announcements. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.

[Survived] BooleanLiteral
main/components/Commons/CommonsOverview.js:23:20
 
     const commonsId = commonsPlus.commons.id;
     useEffect(() => {
-        setLoading(true);
+        setLoading(false);
         setError('');  // Clear previous error state before new request
         const fetchData = async () => {

[Killed] BlockStatement
main/components/Commons/CommonsOverview.js:25:39
     useEffect(() => {
         setLoading(true);
         setError('');  // Clear previous error state before new request
-        const fetchData = async () => {
-            try {
-                const response = await axios.get(`/api/announcements/getbycommonsid?commonsId=${commonsId}`);
-                setAnnouncements(response.data);
-            } catch (error) {
-                // Stryker disable next-line all
-                console.error('Failed to fetch announcements:', error);
-                // Stryker disable next-line all
-                setError('Failed to load announcements');
-            } finally {
-                // Stryker disable next-line all
-                setLoading(false);
-            }
-        };
+        const fetchData = async () => {};
 
         fetchData();
killedBy: CommonsOverview tests No LeaderboardPage for an ordinary user when commons has showLeaderboard = false
statusReason: TestingLibraryElementError: Unable to find an element with the text: Failed to load announcements. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.

[Killed] BlockStatement
main/components/Commons/CommonsOverview.js:26:17
         setLoading(true);
         setError('');  // Clear previous error state before new request
         const fetchData = async () => {
-            try {
-                const response = await axios.get(`/api/announcements/getbycommonsid?commonsId=${commonsId}`);
-                setAnnouncements(response.data);
-            } catch (error) {
+            try {} catch (error) {
                 // Stryker disable next-line all
                 console.error('Failed to fetch announcements:', error);
killedBy: CommonsOverview tests No LeaderboardPage for an ordinary user when commons has showLeaderboard = false
statusReason: TestingLibraryElementError: Unable to find an element with the text: Failed to load announcements. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.

[Killed] StringLiteral
main/components/Commons/CommonsOverview.js:27:50
         setError('');  // Clear previous error state before new request
         const fetchData = async () => {
             try {
-                const response = await axios.get(`/api/announcements/getbycommonsid?commonsId=${commonsId}`);
+                const response = await axios.get(``);
                 setAnnouncements(response.data);
             } catch (error) {
killedBy: CommonsOverview tests Announcements show properly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Announcement 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] BlockStatement
main/components/Commons/CommonsOverview.js:29:29
             try {
                 const response = await axios.get(`/api/announcements/getbycommonsid?commonsId=${commonsId}`);
                 setAnnouncements(response.data);
-            } catch (error) {
-                // Stryker disable next-line all
-                console.error('Failed to fetch announcements:', error);
-                // Stryker disable next-line all
-                setError('Failed to load announcements');
-            } finally {
+            } catch (error) {} finally {
                 // Stryker disable next-line all
                 setLoading(false);
killedBy: CommonsOverview tests No LeaderboardPage for an ordinary user when commons has showLeaderboard = false
statusReason: TestingLibraryElementError: Unable to find an element with the text: Failed to load announcements. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.

[Killed] BlockStatement
main/components/Commons/CommonsOverview.js:34:23
                 console.error('Failed to fetch announcements:', error);
                 // Stryker disable next-line all
                 setError('Failed to load announcements');
-            } finally {
-                // Stryker disable next-line all
-                setLoading(false);
-            }
+            } finally {}
         };
 
killedBy: CommonsOverview tests No LeaderboardPage for an ordinary user when commons has showLeaderboard = false
statusReason: TestingLibraryElementError: Unable to find an element with the text: Failed to load announcements. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.

[Survived] StringLiteral
main/components/Commons/CommonsOverview.js:62:42
                     </Col>
                 </Row>
                 // Stryker disable next-line all
-                <div style={{ marginTop: '20px' }}>
+                <div style={{ marginTop: "" }}>
                     {loading ? (
                         <p>Loading announcements...</p>

[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:67:25
                         <p>Loading announcements...</p>
                     ) : error ? (
                         <p>{error}</p>
-                    ) : announcements.length > 0 ? (
+                    ) : false ? (
                         <Row>
                             <Col>
killedBy: CommonsOverview tests Announcements show properly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Announcement 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] EqualityOperator
main/components/Commons/CommonsOverview.js:67:25
                         <p>Loading announcements...</p>
                     ) : error ? (
                         <p>{error}</p>
-                    ) : announcements.length > 0 ? (
+                    ) : announcements.length <= 0 ? (
                         <Row>
                             <Col>
killedBy: CommonsOverview tests Announcements show properly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Announcement 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] ArrowFunction
main/components/Commons/CommonsOverview.js:70:52
                     ) : announcements.length > 0 ? (
                         <Row>
                             <Col>
-                                {announcements.map((announcement, index) => (
-                                    <Card key={index}>
-                                        <Card.Header>Announcement {index + 1}</Card.Header>
-                                        <Card.Body>{announcement.announcementText}</Card.Body>
-                                    </Card>
-                                ))}
+                                {announcements.map(() => undefined)}
                             </Col>
                         </Row>
killedBy: CommonsOverview tests Announcements show properly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Announcement 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] ArithmeticOperator
main/components/Commons/CommonsOverview.js:72:68
                             <Col>
                                 {announcements.map((announcement, index) => (
                                     <Card key={index}>
-                                        <Card.Header>Announcement {index + 1}</Card.Header>
+                                        <Card.Header>Announcement {index - 1}</Card.Header>
                                         <Card.Body>{announcement.announcementText}</Card.Body>
                                     </Card>
killedBy: CommonsOverview tests Announcements show properly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Announcement 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >
