[Survived] StringLiteral
main/components/Commons/CommonsOverview.js:19:40
     // Stryker disable next-line all
     const [loading, setLoading] = useState(false);
     // Stryker disable once all
-    const [error, setError] = useState('');
+    const [error, setError] = useState("Stryker was here!");
 
     const commonsId = commonsPlus.commons.id;

[Survived] ObjectLiteral
main/components/Commons/CommonsOverview.js:63:24
                 </Row>
                 <div 
                 // Stryker disable once all
-                style={{ marginTop: '20px' }}>
+                style={{}}>
                     {loading ? (
                         <p>Loading announcements...</p>
