[Killed] BooleanLiteral
main/components/Users/UsersTable.js:12:62
 
 export default function UsersTable({ users, currentUser }) {
 
-    const [showModalSuspend, setShowModalSuspend] = useState(false);
+    const [showModalSuspend, setShowModalSuspend] = useState(true);
     const [cellToSuspend, setCellToSuspend] = useState(null);
     const [showModalRestore, setShowModalRestore] = useState(false);
killedBy: Modal tests Clicking Suspend button opens the modal for adminUser
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Users/UsersTable.js:14:62
 
     const [showModalSuspend, setShowModalSuspend] = useState(false);
     const [cellToSuspend, setCellToSuspend] = useState(null);
-    const [showModalRestore, setShowModalRestore] = useState(false);
+    const [showModalRestore, setShowModalRestore] = useState(true);
     const [cellToRestore, setCellToRestore] = useState(null);
 
killedBy: Modal tests Clicking Suspend button opens the modal for adminUser
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Users/UsersTable.js:28:29
     // Stryker disable next-line all : TODO try to make a good test for this
     const suspendCallback = async (cell) => {
         setCellToSuspend(cell);
-        setShowModalSuspend(true);
+        setShowModalSuspend(false);
     }
 
killedBy: Modal tests Clicking Suspend button opens the modal for adminUser
statusReason: Error: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


<html>

[Killed] BlockStatement
main/components/Users/UsersTable.js:31:44
         setShowModalSuspend(true);
     }
 
-    const confirmSuspend = async (cell) => {
-        suspendMutation.mutate(cell);
-        setShowModalSuspend(false);
-    };
+    const confirmSuspend = async (cell) => {};
 
     // Stryker disable all : hard to test for query caching
killedBy: Modal tests Clicking Suspend this User button suspends the user
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Users/UsersTable.js:33:29
 
     const confirmSuspend = async (cell) => {
         suspendMutation.mutate(cell);
-        setShowModalSuspend(false);
+        setShowModalSuspend(true);
     };
 
killedBy: Modal tests Clicking Suspend this User button suspends the user
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Users/UsersTable.js:47:29
     // Stryker disable next-line all : TODO try to make a good test for this
     const restoreCallback = async (cell) => {
         setCellToRestore(cell);
-        setShowModalRestore(true);
+        setShowModalRestore(false);
     }
 
killedBy: Modal tests Clicking Restore button opens the modal for adminUser
statusReason: Error: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


<html>

[Killed] BlockStatement
main/components/Users/UsersTable.js:50:44
         setShowModalRestore(true);
     }
 
-    const confirmRestore = async (cell) => {
-        restoreMutation.mutate(cell);
-        setShowModalRestore(false);
-    };
+    const confirmRestore = async (cell) => {};
 
     const columns = [
killedBy: Modal tests Clicking Restore this User button restores the user
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Users/UsersTable.js:52:29
 
     const confirmRestore = async (cell) => {
         restoreMutation.mutate(cell);
-        setShowModalRestore(false);
+        setShowModalRestore(true);
     };
 
killedBy: Modal tests Clicking Restore this User button restores the user
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] StringLiteral
main/components/Users/UsersTable.js:74:17
         },
         {
             Header: 'Last Online',
-            id: 'lastOnline',
+            id: "",
             accessor: (row) => formatTime(row.lastOnline),
         },
killedBy: UsersTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-lastOnline"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] ArrowFunction
main/components/Users/UsersTable.js:85:23
         {
             Header: 'Suspended',
             id: 'suspended',
-            accessor: (row, _rowIndex) => String(row.suspended) // hack needed for boolean values to show up
+            accessor: () => undefined // hack needed for boolean values to show up
         },
     ];
killedBy: UsersTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:

[Killed] StringLiteral
main/components/Users/UsersTable.js:93:22
 
     const columnsIfAdmin = [
         ...columns,
-        ButtonColumn("Suspend", "danger", suspendCallback, testid),
+        ButtonColumn("", "danger", suspendCallback, testid),
         ButtonColumn("Restore", "success", restoreCallback, testid),
     ];
killedBy: UsersTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:94:33
     const columnsIfAdmin = [
         ...columns,
         ButtonColumn("Suspend", "danger", suspendCallback, testid),
-        ButtonColumn("Restore", "success", restoreCallback, testid),
+        ButtonColumn("Restore", "", restoreCallback, testid),
     ];
 
killedBy: UsersTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-success")

Expected the element to have class:
  btn-success
Received:
  btn

[Killed] ArrowFunction
main/components/Users/UsersTable.js:100:79
     const columnsToDisplay = hasRole(currentUser,"ROLE_ADMIN") ? columnsIfAdmin : columns;
 
     const usersModalSuspend = (
-        <Modal data-testid="UsersTable-Modal" show={showModalSuspend} onHide={() => setShowModalSuspend(false)}>
+        <Modal data-testid="UsersTable-Modal" show={showModalSuspend} onHide={() => undefined}>
             <Modal.Header closeButton>
                 <Modal.Title>Confirm Suspension</Modal.Title>
killedBy: Modal tests Pressing the escape key on the modal cancels the suspension
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Users/UsersTable.js:100:105
     const columnsToDisplay = hasRole(currentUser,"ROLE_ADMIN") ? columnsIfAdmin : columns;
 
     const usersModalSuspend = (
-        <Modal data-testid="UsersTable-Modal" show={showModalSuspend} onHide={() => setShowModalSuspend(false)}>
+        <Modal data-testid="UsersTable-Modal" show={showModalSuspend} onHide={() => setShowModalSuspend(true)}>
             <Modal.Header closeButton>
                 <Modal.Title>Confirm Suspension</Modal.Title>
killedBy: Modal tests Pressing the escape key on the modal cancels the suspension
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Users/UsersTable.js:108:125
                 Are you sure you want to suspend this user?            
             </Modal.Body>
             <Modal.Footer>
-                <Button variant="secondary" data-testid="UsersTable-SuspendModal-Cancel" onClick={() => setShowModalSuspend(false)}>
+                <Button variant="secondary" data-testid="UsersTable-SuspendModal-Cancel" onClick={() => setShowModalSuspend(true)}>
                     Leave this User as is
                 </Button>
killedBy: Modal tests Clicking Leave this User as is button cancels the suspension
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] ArrowFunction
main/components/Users/UsersTable.js:108:99
                 Are you sure you want to suspend this user?            
             </Modal.Body>
             <Modal.Footer>
-                <Button variant="secondary" data-testid="UsersTable-SuspendModal-Cancel" onClick={() => setShowModalSuspend(false)}>
+                <Button variant="secondary" data-testid="UsersTable-SuspendModal-Cancel" onClick={() => undefined}>
                     Leave this User as is
                 </Button>
killedBy: Modal tests Clicking Leave this User as is button cancels the suspension
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] ArrowFunction
main/components/Users/UsersTable.js:111:90
                 <Button variant="secondary" data-testid="UsersTable-SuspendModal-Cancel" onClick={() => setShowModalSuspend(false)}>
                     Leave this User as is
                 </Button>
-                <Button variant="danger" data-testid="UsersTable-Modal-Suspend" onClick={() => confirmSuspend(cellToSuspend)}>
+                <Button variant="danger" data-testid="UsersTable-Modal-Suspend" onClick={() => undefined}>
                     Suspend this User
                 </Button>
killedBy: Modal tests Clicking Suspend this User button suspends the user
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Users/UsersTable.js:118:105
         </Modal> );
 
     const usersModalRestore = (
-        <Modal data-testid="UsersTable-Modal" show={showModalRestore} onHide={() => setShowModalRestore(false)}>
+        <Modal data-testid="UsersTable-Modal" show={showModalRestore} onHide={() => setShowModalRestore(true)}>
             <Modal.Header closeButton>
                 <Modal.Title>Confirm Restoration</Modal.Title>
killedBy: Modal tests Pressing the escape key on the modal cancels the restoration
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] ArrowFunction
main/components/Users/UsersTable.js:118:79
         </Modal> );
 
     const usersModalRestore = (
-        <Modal data-testid="UsersTable-Modal" show={showModalRestore} onHide={() => setShowModalRestore(false)}>
+        <Modal data-testid="UsersTable-Modal" show={showModalRestore} onHide={() => undefined}>
             <Modal.Header closeButton>
                 <Modal.Title>Confirm Restoration</Modal.Title>
killedBy: Modal tests Pressing the escape key on the modal cancels the restoration
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Users/UsersTable.js:126:125
                 Are you sure you want to restore this user?            
             </Modal.Body>
             <Modal.Footer>
-                <Button variant="secondary" data-testid="UsersTable-RestoreModal-Cancel" onClick={() => setShowModalRestore(false)}>
+                <Button variant="secondary" data-testid="UsersTable-RestoreModal-Cancel" onClick={() => setShowModalRestore(true)}>
                     Leave this User as is
                 </Button>
killedBy: Modal tests Clicking Leave this User as is button cancels the restoration
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] ArrowFunction
main/components/Users/UsersTable.js:126:99
                 Are you sure you want to restore this user?            
             </Modal.Body>
             <Modal.Footer>
-                <Button variant="secondary" data-testid="UsersTable-RestoreModal-Cancel" onClick={() => setShowModalRestore(false)}>
+                <Button variant="secondary" data-testid="UsersTable-RestoreModal-Cancel" onClick={() => undefined}>
                     Leave this User as is
                 </Button>
killedBy: Modal tests Clicking Leave this User as is button cancels the restoration
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] ArrowFunction
main/components/Users/UsersTable.js:129:91
                 <Button variant="secondary" data-testid="UsersTable-RestoreModal-Cancel" onClick={() => setShowModalRestore(false)}>
                     Leave this User as is
                 </Button>
-                <Button variant="success" data-testid="UsersTable-Modal-Restore" onClick={() => confirmRestore(cellToRestore)}>
+                <Button variant="success" data-testid="UsersTable-Modal-Restore" onClick={() => undefined}>
                     Restore this User
                 </Button>
killedBy: Modal tests Clicking Restore this User button restores the user
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:142:10
             columns={columnsToDisplay}
             testid={testid}
         />
-        {hasRole(currentUser,"ROLE_ADMIN") && usersModalSuspend}
+        {false}
         {hasRole(currentUser,"ROLE_ADMIN") && usersModalRestore}
     </>);
killedBy: Modal tests Clicking Suspend button opens the modal for adminUser
statusReason: Error: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


<html>

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:142:10
             columns={columnsToDisplay}
             testid={testid}
         />
-        {hasRole(currentUser,"ROLE_ADMIN") && usersModalSuspend}
+        {true}
         {hasRole(currentUser,"ROLE_ADMIN") && usersModalRestore}
     </>);
killedBy: Modal tests Clicking Suspend button opens the modal for adminUser
statusReason: Error: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


<html>

[Killed] LogicalOperator
main/components/Users/UsersTable.js:143:10
             testid={testid}
         />
         {hasRole(currentUser,"ROLE_ADMIN") && usersModalSuspend}
-        {hasRole(currentUser,"ROLE_ADMIN") && usersModalRestore}
+        {hasRole(currentUser, "ROLE_ADMIN") || usersModalRestore}
     </>);
 
killedBy: Modal tests Clicking Restore button opens the modal for adminUser
statusReason: Error: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


<html>

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:143:10
             testid={testid}
         />
         {hasRole(currentUser,"ROLE_ADMIN") && usersModalSuspend}
-        {hasRole(currentUser,"ROLE_ADMIN") && usersModalRestore}
+        {true}
     </>);
 
killedBy: Modal tests Clicking Restore button opens the modal for adminUser
statusReason: Error: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


<html>
