[Killed] BlockStatement
src/main/pages/AdminUsersPage.js:7:30
 import { useCurrentUser } from "main/utils/currentUser";
 
 import { useUsers } from "main/utils/users";
-const AdminUsersPage = () => {
-
-    const { data: users } = useUsers();
-    const { data: currentUser } = useCurrentUser();
-
-    return (
-        <BasicLayout>
-            <h2>Users</h2>
-            <UsersTable users={users} currentUser={currentUser} />
-        </BasicLayout>
-    );
-};
+const AdminUsersPage = () => {};
 
 export default AdminUsersPage;
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: Error: AdminUsersPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
