[Killed] BlockStatement
src/main/utils/usersUtils.js:3:48
 import { toast } from "react-toastify";
 
-export function cellToAxiosParamsSuspend(cell) {
-    return {
-        url: "/api/admin/users/suspend",
-        method: "POST",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsSuspend(cell) {}
 
 export function onSuspendSuccess(message) {
killedBy: UsersUtils cellToAxiosParamsSuspend It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "POST", "params": {"id": 1}, "url": "/api/admin/users/suspend"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/usersUtils.js:4:12
 import { toast } from "react-toastify";
 
 export function cellToAxiosParamsSuspend(cell) {
-    return {
-        url: "/api/admin/users/suspend",
-        method: "POST",
-        params: {
-            id: cell.row.values.id
-        }
-    }
+    return {}
 }
 
killedBy: UsersUtils cellToAxiosParamsSuspend It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "method": "POST",
-   "params": Object {

[Killed] StringLiteral
src/main/utils/usersUtils.js:5:14
 
 export function cellToAxiosParamsSuspend(cell) {
     return {
-        url: "/api/admin/users/suspend",
+        url: "",
         method: "POST",
         params: {
killedBy: UsersUtils cellToAxiosParamsSuspend It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "POST",
    "params": Object {

[Killed] StringLiteral
src/main/utils/usersUtils.js:6:17
 export function cellToAxiosParamsSuspend(cell) {
     return {
         url: "/api/admin/users/suspend",
-        method: "POST",
+        method: "",
         params: {
             id: cell.row.values.id
killedBy: UsersUtils cellToAxiosParamsSuspend It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "method": "POST",
+   "method": "",

[Killed] BlockStatement
src/main/utils/usersUtils.js:13:43
     }
 }
 
-export function onSuspendSuccess(message) {
-    console.log(message);
-    toast(message);
-}
+export function onSuspendSuccess(message) {}
 
 export function cellToAxiosParamsRestore(cell) {
killedBy: UsersUtils onSuspendSuccess It puts the message on console.log and in a toast
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "abc"

Number of calls: 0

[Killed] BlockStatement
src/main/utils/usersUtils.js:18:48
     toast(message);
 }
 
-export function cellToAxiosParamsRestore(cell) {
-    return {
-        url: "/api/admin/users/restore",
-        method: "POST",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsRestore(cell) {}
 
 export function onRestoreSuccess(message) {
killedBy: UsersUtils cellToAxiosParamsRestore It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "POST", "params": {"id": 1}, "url": "/api/admin/users/restore"}
Received: undefined

[Killed] BlockStatement
src/main/utils/usersUtils.js:28:43
     }
 }
 
-export function onRestoreSuccess(message) {
-    console.log(message);
-    toast(message);
-}
+export function onRestoreSuccess(message) {}
killedBy: UsersUtils onRestoreSuccess It puts the message on console.log and in a toast
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "abc"

Number of calls: 0
