[Killed] ConditionalExpression
src/main/pages/PlayPage.js:154:77
     };
 
     // Stryker disable next-line OptionalChaining
-    const isUserInCommon = currentUser?.root?.user?.commons?.some(common => common.id === parseInt(commonsId));
+    const isUserInCommon = currentUser?.root?.user?.commons?.some(common => false);
 
     return (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:154:77
     };
 
     // Stryker disable next-line OptionalChaining
-    const isUserInCommon = currentUser?.root?.user?.commons?.some(common => common.id === parseInt(commonsId));
+    const isUserInCommon = currentUser?.root?.user?.commons?.some(common => true);
 
     return (
killedBy: PlayPage tests disallow user from navigating to unjoined common
statusReason: Error: Unable to find an element with the text: Access Denied.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] LogicalOperator
src/main/pages/PlayPage.js:166:18
         >
             <BasicLayout>
                 <Container>
-                {isUserInCommon && !!currentUser && <CommonsPlay currentUser={currentUser} />}
+                {isUserInCommon || !!currentUser && <CommonsPlay currentUser={currentUser} />}
                     {!isUserInCommon && currentUser && <h1 style={{ color: 'red', backgroundColor: 'black', padding: '50px', 
                     textAlign: 'center' }}>
killedBy: PlayPage tests disallow user from navigating to unjoined common
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="card" data-testid="commons-card" style="opacity: 0.9;"><h1 class="animate-charcter"> Your journey continues farmer steven!</h1></div> instead

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:167:22
             <BasicLayout>
                 <Container>
                 {isUserInCommon && !!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {!isUserInCommon && currentUser && <h1 style={{ color: 'red', backgroundColor: 'black', padding: '50px', 
+                    {isUserInCommon && currentUser && <h1 style={{ color: 'red', backgroundColor: 'black', padding: '50px', 
                     textAlign: 'center' }}>
                         Access Denied.
killedBy: PlayPage tests disallow user from navigating to unjoined common
statusReason: Error: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:171:23
                     textAlign: 'center' }}>
                         Access Denied.
                     </h1> }   
-                    {!!commonsPlus && (
+                    {!commonsPlus && (
                         <CommonsOverview
                             commonsPlus={commonsPlus}
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')
