[Killed] BlockStatement
src/main/utils/useBackend.js:52:81
         });
 }
 
-export function useBackendConsole(queryKey, axiosParameters, initialData, rest) {
-
-    return useQuery({
-        queryKey: queryKey,
-        queryFn: async () => {
-            try {
-                const response = await axios(axiosParameters);
-                return response.data;
-            } catch (e) {
-                // Stryker disable next-line OptionalChaining
-                if (e.response?.data?.message) {
-                    console.log(e.response.data.message);
-                } else {
-                    const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-                    toast.error(errorMessage);
-                }
-                throw e;
-            }
-        }, 
-        initialData: initialData,
-        ...rest
-        });
-}
+export function useBackendConsole(queryKey, axiosParameters, initialData, rest) {}
 
 const wrappedParams = async (params) => {
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackendConsole handles 404 error correctly
statusReason: Error: Timed out in waitFor after 1000ms.
